#include <stdio.h>

/// <summary>
/// a:b第二，我第三。
/// b：我第二，e第四。
/// c：我第一，d第二。
/// d：c最后，我第三。
/// e：我第四，a第一。
/// 每个选手说对一半，求比赛名次。
/// 
/// 思路：每个选手说的条件有且只有一个为true
/// 一共有5的5次方个可能性。
/// 注意：名次可能重复，可以设置一个条件，但是1~5每个名称相乘的结果是一定的。 
/// </summary>
/// <returns></returns>
int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;

	for (a = 1;a <= 5;a++)
	{
		for (b = 1;b <= 5;b++)
		{
			for (c = 1;c <= 5;c++)
			{
				for (d = 1;d <= 5;d++)
				{
					for (e = 1;e <= 5;e++)
					{
						if (((b == 2) + (a == 3) == 1) &&
							((b == 2) + (e == 4) == 1) &&
							((c == 2) + (d == 3) == 1) &&
							((c == 5) + (d == 3) == 1) &&
							((e == 4) + (a == 1) == 1))
						{
							if ((a * b * c * d * e) == 120)
								printf("a=%d b=%d c=%d d=%d e=%d \n", a, b, c, d, e); //得出：a=1 b=2 c=4 d=3 e=5


						}

					}

				}

			}
		}
	}

	return 0;
}



